app/Controllers/Home.php

    public function index()
    {
        $data = $this->data;
        $data['koleksi_terbaru'] = $this->model->getHomeBook();
        $data['berita'] = $this->model->getHomeArtikel('berita');
        $data['pengumuman'] = $this->model->getHomeArtikel('pengumuman');
        $data['agenda'] = $this->model->getHomeArtikel('agenda');
        $data['sliders'] = $this->sliderModel->findAll();
---
SELECT *
FROM `slider`