app/Models/MenuModel.php

UPDATE `menu` SET `parent_id` = NULL, `urutan` = 4
WHERE `menu_id` = '29'
---
            }

            if ($data_db) {
                $result = $this->db->table('menu')->update($data_db, ['menu_id=' => $row['menu_id']]);