app/Models/UserModel.php

UPDATE `user` SET `username` = 'penulis', `nama` = 'Penulis', `email` = 'penulis@gmail.com', `is_active` = '1'
WHERE `user_id` = '8'
DELETE FROM `user_role`
WHERE `user_id` = '8'
INSERT INTO `user_role` (`role_id`, `user_id`)
VALUES ('8','8')
---
    public function saveDataUser()
    {
        $method = $this->request->getPost('method');
        $fields = ['username', 'nama', 'email', 'is_active'];

        foreach ($fields as $field) {
            $data_db[$field] = $this->request->getPost($field);
        }

        if ($this->request->getPost('password')) {
            $data_db['password'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        }

        $this->db->transStart();

        if (!empty($this->request->getPost('id'))) {
            $user_id = $this->request->getPost('id');
            $this->db->table('user')->update($data_db, ['user_id' => $user_id]);
        } else {
            $this->db->table('user')->insert($data_db);
            $user_id = $this->db->insertID();
        }

        if (!empty(@$_POST['role_id'])) {
            $data_db = [];
            foreach ($_POST['role_id'] as $role_id) {
                $data_db[] = ['user_id' => $user_id, 'role_id' => $role_id];
            }

            $this->db->table('user_role')->delete(['user_id' => $user_id]);
            $this->db->table('user_role')->insertBatch($data_db);

UPDATE `user` SET `image` = 'avatar(1).png'
WHERE `user_id` = '8'
---
                // Update image
                $data_db = [];
                $data_db['image'] = $new_name;
                $save = $this->db->table('user')->update($data_db, ['user_id' => $user_id]);